Public Attributes | List of all members
API_AttributeManagerFormat Struct Reference
Add-On Integration
Represents the data of an attribute manager format. More...
#include <APIdefs_Registration.h>
 Public Attributes
GSType  | fileType
Macintosh file type (e.g. 'TEXT').
GSType  | fileCreator
Creator on Macintosh (e.g. 'GSAC' for Archicad).
GS::UniString  | popupText
Description of the file type.
GS::UniString  | fileExtension
The extension used on Windows (e.g. "txt").
Detailed Description
Represents the data of an attribute manager format.
Since
Archicad 26
Member Data Documentation
◆ fileCreator
 API_AttributeManagerFormat::fileCreator
Creator on Macintosh (e.g. 'GSAC' for Archicad).
◆ fileExtension
 API_AttributeManagerFormat::fileExtension
The extension used on Windows (e.g. "txt").
◆ fileType
 API_AttributeManagerFormat::fileType
Macintosh file type (e.g. 'TEXT').
◆ popupText
 API_AttributeManagerFormat::popupText
Description of the file type.